Revit 2027 API
DoubleParameterValue(Double) Constructor
 Value constructor
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DoubleParameterValue(
	double value
)
Public Sub New (
	value As Double
)
public:
DoubleParameterValue(
	double value
)
new :
        value : float -> DoubleParameterValue
Parameters
value Double
See Also
Reference
DoubleParameterValue Class
DoubleParameterValue Overload
Autodesk.Revit.DB Namespace